tutorials/icoDyMFoam/movingConeMotion/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          dynamicMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

twoDMotion      yes;

dynamicFvMesh dynamicMotionSolverFvMesh;

solver          laplaceFaceDecomposition;

diffusivity     file;

frozenDiffusion off;

distancePatches 
(
    movingWall
    farFieldMoving
);


// ************************************************************************* //
